# -*- mode: org; mode: org-make-toc; org-id-link-to-org-use-id: nil

*** LaCarte
:PROPERTIES:
:CREATED_TIME: [2019-01-01 Tue 12:16]
:ID:       9f69a1f2-bc17-4dd1-b98e-51a398b0cb6e
:END:
:LOGBOOK:
CLOCK: [2019-01-01 Tue 12:16]--[2019-01-01 Tue 12:18] =>  0:02
:END:

Emacs seems to have a problem with popups on Chrome OS. Now ~<f10>~ is a dangerous key by default, so I will remap the key to lacarte instead:

#+begin_src emacs-lisp
  (use-package lacarte
    :commands (lacarte-execute-menu-command))
  (akirak/bind-key [remap menu-bar-open] #'lacarte-execute-menu-command)
#+end_src
*** Rust
:PROPERTIES:
:CREATED_TIME: [2019-01-01 Tue 15:54]
:ID:       e15d3e74-9760-4e6f-ba18-9cb337758247
:END:
:LOGBOOK:
CLOCK: [2019-01-01 Tue 15:54]--[2019-01-01 Tue 15:56] =>  0:02
:END:
#+begin_src emacs-lisp
  (use-package rust-mode)
#+end_src
**** Org-agenda keybindings                              :Emacs:Org__Mode:
:PROPERTIES:
:CREATED_TIME: [2019-01-19 Sat 12:22]
:END:
:LOGBOOK:
CLOCK: [2019-01-19 Sat 12:22]--[2019-01-19 Sat 12:25] =>  0:03
:END:

#+begin_src emacs-lisp
  (general-def org-agenda-mode-map :package 'org-agenda
    "M-n" #'org-agenda-drag-line-forward
    "M-p" #'org-agenda-drag-line-backward)
#+end_src
